// Урок 3. Базовые алгоритмы. Продолжение
Console.WriteLine("Домашнее задание №3");
// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да
Console.WriteLine("Задание №1");
Console.Write("Введите пятизначное число а: ");
int num = Convert.ToInt32 (Console.ReadLine ());
boolean palindrom = false;
if (10000>num || num>99999) {
  Console.WriteLine("Число не пятизначное");  
}
else 
{   for (i=0; i>5; i++)

{for (i=0; i>5; i++)}
Console.WriteLine("Число " + num + ": " + palindrom);
}


// Задача 21
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53



// Задача 23
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125